In [1]:
# Initial imports
import pandas as pd
import numpy as np
import datetime as dt
from pathlib import Path

%matplotlib inline

# Set the path for each CSV file
whale_returns_path = Path("whale_returns.csv")
algo_returns_path = Path("algo_returns.csv")
sp_tsx_history_path = Path("sp_tsx_history.csv")


# Read in the data into Pandas DataFrames
whale_returns = pd.read_csv(whale_returns_path, parse_dates=True, infer_datetime_format=True)
algo_returns = pd.read_csv(algo_returns_path, parse_dates=True, infer_datetime_format=True)
sp_tsx_history = pd.read_csv(sp_tsx_history_path, parse_dates=True, infer_datetime_format=True)

In [3]:
##  Whale Returns
## Read the Whale Portfolio daily returns and clean the data.
# Reading whale returns

whale_returns.head()

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
0,2015-03-02,NaN,NaN,NaN,NaN
1,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2,2015-03-04,0.002230,0.003241,-0.002534,0.004213
3,2015-03-05,0.004016,0.004076,0.002355,0.006726
4,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098

In [4]:
whale_returns.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1060 entries, 0 to 1059
Data columns (total 5 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Date                         1060 non-null   object
 1   SOROS FUND MANAGEMENT LLC    1059 non-null   float64
 2   PAULSON & CO.INC.            1059 non-null   float64
 3   TIGER GLOBAL MANAGEMENT LLC  1059 non-null   float64
 4   BERKSHIRE HATHAWAY INC       1059 non-null   float64
dtypes: float64(4), object(1)
memory usage: 41.5+ KB

In [5]:
# Retrieve DataFrame data types

whale_returns.dtypes

Date                            object
SOROS FUND MANAGEMENT LLC      float64
PAULSON & CO.INC.              float64
TIGER GLOBAL MANAGEMENT LLC    float64
BERKSHIRE HATHAWAY INC         float64
dtype: object

In [6]:
# Identify Series count

whale_returns.count()

Date                           1060
SOROS FUND MANAGEMENT LLC      1059
PAULSON & CO.INC.              1059
TIGER GLOBAL MANAGEMENT LLC    1059
BERKSHIRE HATHAWAY INC         1059
dtype: int64

In [7]:
# Check duplicates
whale_returns.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1055    False
1056    False
1057    False
1058    False
1059    False
Length: 1060, dtype: bool

In [8]:
# Count nulls

whale_returns.isnull().mean() * 100

Date                           0.00000
SOROS FUND MANAGEMENT LLC      0.09434
PAULSON & CO.INC.              0.09434
TIGER GLOBAL MANAGEMENT LLC    0.09434
BERKSHIRE HATHAWAY INC         0.09434
dtype: float64

In [9]:
# Count nulls
whale_returns.isnull().sum()

Date                           0
SOROS FUND MANAGEMENT LLC      1
PAULSON & CO.INC.              1
TIGER GLOBAL MANAGEMENT LLC    1
BERKSHIRE HATHAWAY INC         1
dtype: int64

In [10]:
# Drop nulls

whale_returns = whale_returns.dropna().copy()

In [11]:
## Validate no more missing values

whale_returns.isnull().sum()

Date                           0
SOROS FUND MANAGEMENT LLC      0
PAULSON & CO.INC.              0
TIGER GLOBAL MANAGEMENT LLC    0
BERKSHIRE HATHAWAY INC         0
dtype: int64

In [12]:
##  Algorithmic Daily Returns
## Read the algorithmic daily returns and clean the data.

algo_returns.info

<bound method DataFrame.info of             Date    Algo 1    Algo 2
0     2014-05-28  0.001745       NaN
1     2014-05-29  0.003978       NaN
2     2014-05-30  0.004464       NaN
3     2014-06-02  0.005692       NaN
4     2014-06-03  0.005292       NaN
...          ...       ...       ...
1236  2019-04-25  0.000682 -0.007247
1237  2019-04-26  0.002981  0.005256
1238  2019-04-29  0.005208  0.002829
1239  2019-04-30 -0.002944 -0.001570
1240  2019-05-01  0.000094 -0.007358

[1241 rows x 3 columns]>

In [13]:
# Retrieve DataFrame data types

algo_returns.head()

         Date    Algo 1  Algo 2
0  2014-05-28  0.001745     NaN
1  2014-05-29  0.003978     NaN
2  2014-05-30  0.004464     NaN
3  2014-06-02  0.005692     NaN
4  2014-06-03  0.005292     NaN

In [14]:
# Identify Series count

algo_returns.count()

Date      1241
Algo 1    1241
Algo 2    1235
dtype: int64

In [15]:
# Check duplicates

algo_returns.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1236    False
1237    False
1238    False
1239    False
1240    False
Length: 1241, dtype: bool

In [16]:
# Count nulls

algo_returns.isnull().sum()

Date      0
Algo 1    0
Algo 2    6
dtype: int64

In [17]:
# Drop nulls

algo_returns = algo_returns.dropna().copy()

In [18]:
## Validate no more missing values

algo_returns.isnull().sum()

Date      0
Algo 1    0
Algo 2    0
dtype: int64

In [19]:
## data types

algo_returns.dtypes

Date       object
Algo 1    float64
Algo 2    float64
dtype: object

In [20]:
##  S&P TSX 60 Returns
## Read the S&P TSX 60 historic closing prices and 
## create a new daily returns DataFrame from the data.

sp_tsx_history.head()

        Date        Close
0  01-Oct-12  $12,370.19
1  02-Oct-12  $12,391.23
2  03-Oct-12  $12,359.47
3  04-Oct-12  $12,447.68
4  05-Oct-12  $12,418.99

In [21]:
# Check Data Types

sp_tsx_history.dtypes

Date     object
Close    object
dtype: object

In [22]:
# Identify Series count

sp_tsx_history.count()

Date     1818
Close    1818
dtype: int64

In [23]:
# Check duplicates

sp_tsx_history.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1813    False
1814    False
1815    False
1816    False
1817    False
Length: 1818, dtype: bool

In [24]:
# Count nulls

sp_tsx_history.isnull().sum()

Date     0
Close    0
dtype: int64

In [25]:
# Check Data Types

sp_tsx_history.dtypes

Date     object
Close    object
dtype: object

In [26]:
# Clean identified numeric fields with $ symbol and commas

sp_tsx_history["Close"] = sp_tsx_history["Close"].str.replace("$", "")
sp_tsx_history["Close"] = sp_tsx_history["Close"].str.replace(",", "")
sp_tsx_history["Close"]

<ipython-input-26-e54d1fb92733>:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  sp_tsx_history["Close"] = sp_tsx_history["Close"].str.replace("$", "")

0       12370.19
1       12391.23
2       12359.47
3       12447.68
4       12418.99
          ...
1813    17118.44
1814    17128.71
1815    17180.15
1816    17168.21
1817    17098.56
Name: Close, Length: 1818, dtype: object

In [27]:
# Retrieve data types to confirm what needs to be converted

sp_tsx_history.dtypes

Date     object
Close    object
dtype: object

In [28]:
# Convert `Close` from `object` to `float`

sp_tsx_history["Close"]=sp_tsx_history["Close"].astype("float")
sp_tsx_history

           Date     Close
0     01-Oct-12  12370.19
1     02-Oct-12  12391.23
2     03-Oct-12  12359.47
3     04-Oct-12  12447.68
4     05-Oct-12  12418.99
...         ...       ...
1813  20-Dec-19  17118.44
1814  23-Dec-19  17128.71
1815  24-Dec-19  17180.15
1816  27-Dec-19  17168.21
1817  30-Dec-19  17098.56

[1818 rows x 2 columns]

In [29]:
# Confirm conversion to float

sp_tsx_history.dtypes

Date      object
Close    float64
dtype: object

In [30]:
# Calculate Daily Returns - set date as index and drop extra date column

# Set the date as the index to the DataFrame
sp_tsx_history= sp_tsx_history.set_index(pd.to_datetime(sp_tsx_history["Date"], infer_datetime_format=True))
sp_tsx_history.head()

                 Date     Close
Date
2012-10-01  01-Oct-12  12370.19
2012-10-02  02-Oct-12  12391.23
2012-10-03  03-Oct-12  12359.47
2012-10-04  04-Oct-12  12447.68
2012-10-05  05-Oct-12  12418.99

In [31]:
 # Drop the extra Date column
    
sp_tsx_history = sp_tsx_history.drop(columns=["Date"])
sp_tsx_history.head()

               Close
Date
2012-10-01  12370.19
2012-10-02  12391.23
2012-10-03  12359.47
2012-10-04  12447.68
2012-10-05  12418.99

In [32]:
# Calculate the daily returns 

sp_tsx_history = sp_tsx_history.pct_change()
sp_tsx_history.head()

               Close
Date
2012-10-01       NaN
2012-10-02  0.001701
2012-10-03 -0.002563
2012-10-04  0.007137
2012-10-05 -0.002305

In [33]:
# Drop nulls

sp_tsx_history = sp_tsx_history.dropna().copy()

In [34]:
# Count nulls

sp_tsx_history.isnull().sum()

Close    0
dtype: int64

In [35]:
# Rename `Close` Column to be specific to this portfolio.

sp_tsx_history = sp_tsx_history.rename(columns={
    
    "Close" : "TSX_60_Index",
    
    

})
sp_tsx_history.head()

            TSX_60_Index
Date
2012-10-02      0.001701
2012-10-03     -0.002563
2012-10-04      0.007137
2012-10-05     -0.002305
2012-10-09     -0.011709

In [36]:
## Combine Whale, Algorithmic, and S&P TSX 60 Returns
## First, set Date as index for whale_returns & algo_returns

whale_returns = whale_returns.set_index("Date")
algo_returns = algo_returns.set_index("Date")

In [37]:
whale_returns.head()

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2015-03-04,0.002230,0.003241,-0.002534,0.004213
2015-03-05,0.004016,0.004076,0.002355,0.006726
2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098
2015-03-09,0.000582,0.004225,0.005843,-0.001652

In [38]:
algo_returns.head()

              Algo 1    Algo 2
Date
2014-06-05  0.004062  0.013285
2014-06-06  0.001857  0.008284
2014-06-09 -0.005012  0.005668
2014-06-10  0.004406 -0.000735
2014-06-11  0.004760 -0.003761

In [40]:
## Combine Whale, Algorithmic, and S&P TSX 60 Returns

all_returns = pd.concat([whale_returns, algo_returns, sp_tsx_history], axis='columns', join='inner')
all_returns.head()

Empty DataFrame
Columns: [SOROS FUND MANAGEMENT LLC, PAULSON & CO.INC. , TIGER GLOBAL MANAGEMENT LLC, BERKSHIRE HATHAWAY INC, Algo 1, Algo 2, TSX_60_Index]
Index: []